000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. hello-world.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 STR PIC X(13) VALUE 'Hello, world.'.
000600 PROCEDURE DIVISION.
000700 DISPLAY STR.
000800 DISPLAY FUNCTION UPPER-CASE(STR).
000900 DISPLAY FUNCTION LOWER-CASE(STR)
001000 .
